-- drop table art_style

CREATE TABLE IF NOT EXISTS public.art_style
(
    id SERIAL PRIMARY KEY,
    title character varying(255)
    );

INSERT INTO public.art_style (title) VALUES
     ('Реализм'),('Импрессионизм'),('Экспрессионизм'),('Абстракционизм'),('Сюрреализм'),('Кубизм'),('Романтизм'),('Барокко'),
     ('Рококо'),('Неоклассицизм'),('Минимализм'),('Поп-арт'),('Современное искусство'),('Фотореализм'),('Пейзажная живопись'),
     ('Портретная живопись'),('Натюрморт'),('Фантастика'),('Наивное искусство'),('Символизм'),('Постимпрессионизм'),
     ('Ар-нуво'),('Пуантилизм'),('Фовизм'),('Дадаизм'),('Ар-деко'),('Неоимпрессионизм');

-- drop table art_material

CREATE TABLE IF NOT EXISTS public.art_material (
                                                   id SERIAL PRIMARY KEY,
                                                   material_name VARCHAR(255) NOT NULL
    );

INSERT INTO public.art_material (material_name) VALUES
    ('Масляные краски'), ('Акриловые краски'), ('Акварель'), ('Темпера'),('Пастель'), ('Уголь'),('Графит'),('Чернила'),
    ('Перо'),('Карандаш'),('Маркер'),('Коллаж'),('Смешанные материалы'),('Цифровая живопись'),('Аэрозольная краска'),
    ('Песок'),('Глина'),('Металл'),('Дерево'),('Холст'),('Бумага'),('Ткань'),('Стекло'),('Керамика'),('Пластик'),('Проволока');

CREATE TABLE IF NOT EXISTS public.art_technique (
                                                    id SERIAL PRIMARY KEY,
                                                    technique_name VARCHAR(255) NOT NULL
    );

-- drop table art_technique

INSERT INTO public.art_technique (technique_name) VALUES
    ('Мазки кистью'),('Мастихин'),('Мытье'),('Глазурь'),('Сухая кисть'),('Мокрый на мокром'),('Мокрый на сухом'),
    ('Брызги'),('Губка'),('Рисование пальцами'),('Пуантилизм'),('Штриховка'),('Скретчборд'),('Энкаустика'),('Шелкография'),
    ('Аэрография'),('Мраморирование'),('Позолота'),('Декалькомания'),('Точечная роспись'),('Граффити'),('Цифровая живопись'),
    ('Коллаж'),('Импасто'),('Монотипия'),('Дереворез'),('Линогравюра'),('Шелкография'),('Интарсия'),('Фреска'),('Мозаика');